//**************************************************************
// JSON配列の抽出方法サンプル
//**************************************************************
var data = 
[{
    "division": "営業部",
    "person": [
        {"name":"山田","age":21},
        {"name":"佐藤","age":56},
        {"name":"鈴木","age":33}
    ]
 },
 {
    "division": "製造部",
    "person": [
        {"name":"安倍","age":44},
        {"name":"藤沢","age":19},
        {"name":"渡辺","age":26}
    ]
 }];


//*************************************
//  1番目の要素のpersonの1番目を抽出
//*************************************
console.log('****************************************');
console.log('*** 1番目の要素のpersonの1番目を抽出    ');
console.log('****************************************');
console.log(JSON.stringify(data[1].person[1].name) + '\n\n');


//*************************************
//  2番目の要素を抽出
//*************************************
var data2 = data.filter(function(item,index){
    if (item.division == '製造部') return true
//  if (index == 1) return true  //２番目の要素
});
console.log('****************************************');
console.log('*** 2番目の要素を抽出                   ');
console.log('****************************************');
console.log(JSON.stringify(data2) + '\n\n' );
//console.log(data2 + '\n\n');


